# Day Objectives:
## Pandas Dataframes
- Creating Dataframe using List, Dict, Numpy, Pandas series
- Dataframe Indexing
- Dataframe Merging
- Dataframe Sorting
- Dataframe Grouping
- DataFrame Filtering
- Dataframe - Applying Statastical & math operations on it
- Saving

### Creating Dataframe using List, Dict, Numpy, Pandas series

In [1]:
import pandas as pd

In [2]:
li = [[1,2,3],[4,5,6],[6,7,8]]
df1 = pd.DataFrame(li)
df1
# columns and rows index starts from 0

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
df1.shape

(3, 3)

In [6]:
df1.columns

RangeIndex(start=0, stop=3, step=1)

In [7]:
df1.columns = ["A","B","C"]
df1

   A  B  C
0  1  2  3
1  4  5  6
2  6  7  8

In [8]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
df1.index = ["x","y",'z']
df1

   A  B  C
x  1  2  3
y  4  5  6
z  6  7  8

In [16]:
di = {
    "Name" : ["Supriya", "Thanuja", "Ashok", "Srikanth", "sahithi"],
    "Gender" : ["F", "F", "M", "M", "F"],
    "FFood" : ["Chicken","Potato","South dishes", "laddu", "manchuria"]
}
df2 = pd.DataFrame(di)
df2

       Name Gender         FFood
0   Supriya      F       Chicken
1   Thanuja      F        Potato
2     Ashok      M  South dishes
3  Srikanth      M         laddu
4   sahithi      F     manchuria

In [17]:
df2.columns

Index(['Name', 'Gender', 'FFood'], dtype='object')

In [18]:
df2.index = [1,2,3,4,5]
df2

       Name Gender         FFood
1   Supriya      F       Chicken
2   Thanuja      F        Potato
3     Ashok      M  South dishes
4  Srikanth      M         laddu
5   sahithi      F     manchuria

## DataFrame Indexing

In [19]:
df2["Name"]

1     Supriya
2     Thanuja
3       Ashok
4    Srikanth
5     sahithi
Name: Name, dtype: object

In [20]:
type(df2["Name"])

pandas.core.series.Series

In [21]:
df2["Gender"]

1    F
2    F
3    M
4    M
5    F
Name: Gender, dtype: object

In [25]:
df2[["Name", "FFood"]] # accessing subset

       Name         FFood
1   Supriya       Chicken
2   Thanuja        Potato
3     Ashok  South dishes
4  Srikanth         laddu
5   sahithi     manchuria

In [31]:
df2[ :1 ]

      Name Gender    FFood
1  Supriya      F  Chicken

In [34]:
df2[ 3:5 ] # it takes default values starts from 0

       Name Gender      FFood
4  Srikanth      M      laddu
5   sahithi      F  manchuria

In [37]:
df2[4:5]["FFood"]

5    manchuria
Name: FFood, dtype: object

#

## Loc -  accessing other than integer index values
## iloc - Accessing Integer Index

In [38]:
df2.iloc[2]

Name             Ashok
Gender               M
FFood     South dishes
Name: 3, dtype: object

In [39]:
df2

       Name Gender         FFood
1   Supriya      F       Chicken
2   Thanuja      F        Potato
3     Ashok      M  South dishes
4  Srikanth      M         laddu
5   sahithi      F     manchuria

In [46]:
df2.iloc[4]

Name        sahithi
Gender            F
FFood     manchuria
Name: 5, dtype: object

In [48]:
df2.loc[4, "FFood"]

'laddu'

In [50]:
df2.loc[3, ["Name", "FFood"]]

Name            Ashok
FFood    South dishes
Name: 3, dtype: object

In [53]:
df2.loc[[3,2,4], ["Name", "Gender"]]

       Name Gender
3     Ashok      M
2   Thanuja      F
4  Srikanth      M

In [54]:
df2

       Name Gender         FFood
1   Supriya      F       Chicken
2   Thanuja      F        Potato
3     Ashok      M  South dishes
4  Srikanth      M         laddu
5   sahithi      F     manchuria

In [55]:
# what is the gender of srikanth
df2.loc[4, "Gender"]

'M'

In [56]:
df2.FFood

1         Chicken
2          Potato
3    South dishes
4           laddu
5       manchuria
Name: FFood, dtype: object

In [59]:
df2.set_index("Name", inplace = True)

In [60]:
df2

         Gender         FFood
Name
Supriya       F       Chicken
Thanuja       F        Potato
Ashok         M  South dishes
Srikanth      M         laddu
sahithi       F     manchuria

In [62]:
df2.loc["Thanuja"]

Gender         F
FFood     Potato
Name: Thanuja, dtype: object

In [64]:
df2.loc["Srikanth"]["Gender"]

'M'

In [65]:
df2.index

Index(['Supriya', 'Thanuja', 'Ashok', 'Srikanth', 'sahithi'], dtype='object', name='Name')

In [69]:
df2.reset_index(inplace = True)

In [70]:
df2

       Name Gender         FFood
0   Supriya      F       Chicken
1   Thanuja      F        Potato
2     Ashok      M  South dishes
3  Srikanth      M         laddu
4   sahithi      F     manchuria

## DataFrame Merging

In [73]:
d2 = {
    "Name" : ["Supriya", "Thanuja", "Srikanth", "sahithi"],
    "Color": ["White", "Blue", "Pink", "Red"],
    "FFood" : ["Chicken","Potato", "laddu", "manchuria"]
}
df3 = pd.DataFrame(d2)
df3

       Name  Color      FFood
0   Supriya  White    Chicken
1   Thanuja   Blue     Potato
2  Srikanth   Pink      laddu
3   sahithi    Red  manchuria

In [72]:
df2

       Name Gender         FFood
0   Supriya      F       Chicken
1   Thanuja      F        Potato
2     Ashok      M  South dishes
3  Srikanth      M         laddu
4   sahithi      F     manchuria

In [75]:
pd.concat([df2,df3], axis = 0)

       Name Gender         FFood  Color
0   Supriya      F       Chicken    NaN
1   Thanuja      F        Potato    NaN
2     Ashok      M  South dishes    NaN
3  Srikanth      M         laddu    NaN
4   sahithi      F     manchuria    NaN
0   Supriya    NaN       Chicken  White
1   Thanuja    NaN        Potato   Blue
2  Srikanth    NaN         laddu   Pink
3   sahithi    NaN     manchuria    Red

In [76]:
pd.concat([df2,df3], axis = 1)

       Name Gender         FFood      Name  Color      FFood
0   Supriya      F       Chicken   Supriya  White    Chicken
1   Thanuja      F        Potato   Thanuja   Blue     Potato
2     Ashok      M  South dishes  Srikanth   Pink      laddu
3  Srikanth      M         laddu   sahithi    Red  manchuria
4   sahithi      F     manchuria       NaN    NaN        NaN

In [77]:
df2.append(df3)

       Name Gender         FFood  Color
0   Supriya      F       Chicken    NaN
1   Thanuja      F        Potato    NaN
2     Ashok      M  South dishes    NaN
3  Srikanth      M         laddu    NaN
4   sahithi      F     manchuria    NaN
0   Supriya    NaN       Chicken  White
1   Thanuja    NaN        Potato   Blue
2  Srikanth    NaN         laddu   Pink
3   sahithi    NaN     manchuria    Red

In [78]:
df3.append(df2)

       Name  Color         FFood Gender
0   Supriya  White       Chicken    NaN
1   Thanuja   Blue        Potato    NaN
2  Srikanth   Pink         laddu    NaN
3   sahithi    Red     manchuria    NaN
0   Supriya    NaN       Chicken      F
1   Thanuja    NaN        Potato      F
2     Ashok    NaN  South dishes      M
3  Srikanth    NaN         laddu      M
4   sahithi    NaN     manchuria      F

In [79]:
pd.merge(df2,df3) # it returns common data from both df's

       Name Gender      FFood  Color
0   Supriya      F    Chicken  White
1   Thanuja      F     Potato   Blue
2  Srikanth      M      laddu   Pink
3   sahithi      F  manchuria    Red

In [80]:
df2

       Name Gender         FFood
0   Supriya      F       Chicken
1   Thanuja      F        Potato
2     Ashok      M  South dishes
3  Srikanth      M         laddu
4   sahithi      F     manchuria

In [81]:
df3

       Name  Color      FFood
0   Supriya  White    Chicken
1   Thanuja   Blue     Potato
2  Srikanth   Pink      laddu
3   sahithi    Red  manchuria

In [83]:
pd.merge(df2,df3, how = "left")

       Name Gender         FFood  Color
0   Supriya      F       Chicken  White
1   Thanuja      F        Potato   Blue
2     Ashok      M  South dishes    NaN
3  Srikanth      M         laddu   Pink
4   sahithi      F     manchuria    Red

In [84]:
pd.merge(df2,df3, how = "right")

       Name Gender      FFood  Color
0   Supriya      F    Chicken  White
1   Thanuja      F     Potato   Blue
2  Srikanth      M      laddu   Pink
3   sahithi      F  manchuria    Red

In [85]:
pd.merge(df2,df3, how = "inner") # common data -  intersection

       Name Gender      FFood  Color
0   Supriya      F    Chicken  White
1   Thanuja      F     Potato   Blue
2  Srikanth      M      laddu   Pink
3   sahithi      F  manchuria    Red

In [86]:
pd.merge(df2,df3, how = "outer")  # all data from both df'd - Union

       Name Gender         FFood  Color
0   Supriya      F       Chicken  White
1   Thanuja      F        Potato   Blue
2     Ashok      M  South dishes    NaN
3  Srikanth      M         laddu   Pink
4   sahithi      F     manchuria    Red

In [87]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how: str = 'inner', on=None, left_on=None, right_on=None, left_index: bool = False, right_index: bool = False, sort: bool = False, suffixes=('_x', '_y'), copy: bool = True, indicator: bool = False, validate=None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

* left: use only keys from left frame, similar to a SQL left outer join;
preserve key order.
* right: use only keys from right frame, similar to a SQL right outer join;
preserve key order.
* outer: use union of keys from both frames, similar to a SQL full outer
join; sort keys lexicographically.
* inner: use intersection of keys from both frames, similar to a SQL inner
join; preserve the order of the left keys.

## DataFrame Sorting

In [88]:
df3

       Name  Color      FFood
0   Supriya  White    Chicken
1   Thanuja   Blue     Potato
2  Srikanth   Pink      laddu
3   sahithi    Red  manchuria

In [91]:
df3.sort_index(axis = 0, ascending=False)

       Name  Color      FFood
3   sahithi    Red  manchuria
2  Srikanth   Pink      laddu
1   Thanuja   Blue     Potato
0   Supriya  White    Chicken

In [92]:
df3.sort_index(axis = 1, ascending=False)

       Name      FFood  Color
0   Supriya    Chicken  White
1   Thanuja     Potato   Blue
2  Srikanth      laddu   Pink
3   sahithi  manchuria    Red

In [93]:
df3.sort_index(axis = 1, ascending=True)

   Color      FFood      Name
0  White    Chicken   Supriya
1   Blue     Potato   Thanuja
2   Pink      laddu  Srikanth
3    Red  manchuria   sahithi

In [96]:
df3.sort_values("Name", ascending=False)

       Name  Color      FFood
3   sahithi    Red  manchuria
1   Thanuja   Blue     Potato
0   Supriya  White    Chicken
2  Srikanth   Pink      laddu

In [95]:
df3

       Name  Color      FFood
0   Supriya  White    Chicken
1   Thanuja   Blue     Potato
2  Srikanth   Pink      laddu
3   sahithi    Red  manchuria

In [103]:
df3.sort_values(["FFood", "Color"], ascending= False)

       Name  Color      FFood
3   sahithi    Red  manchuria
2  Srikanth   Pink      laddu
1   Thanuja   Blue     Potato
0   Supriya  White    Chicken